{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "lm_heads.0",
    "lm_heads.1.",
    "lm_heads.2",
    "lm_heads.3"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.decoder.layers.18.encoder_attn.v_proj",
    "model.decoder.layers.6.encoder_attn.q_proj",
    "model.decoder.layers.9.encoder_attn.v_proj",
    "model.decoder.layers.20.encoder_attn.q_proj",
    "model.decoder.layers.7.encoder_attn.v_proj",
    "model.decoder.layers.13.self_attn.v_proj",
    "model.decoder.layers.9.self_attn.q_proj",
    "model.decoder.layers.10.encoder_attn.q_proj",
    "model.decoder.layers.11.encoder_attn.q_proj",
    "model.decoder.layers.21.encoder_attn.v_proj",
    "model.decoder.layers.0.encoder_attn.v_proj",
    "model.decoder.layers.4.self_attn.q_proj",
    "model.decoder.layers.5.self_attn.q_proj",
    "model.decoder.layers.3.encoder_attn.q_proj",
    "model.decoder.layers.21.encoder_attn.q_proj",
    "model.decoder.layers.6.encoder_attn.v_proj",
    "model.decoder.layers.18.self_attn.q_proj",
    "model.decoder.layers.22.encoder_attn.v_proj",
    "model.decoder.layers.9.self_attn.v_proj",
    "model.decoder.layers.9.encoder_attn.q_proj",
    "model.decoder.layers.14.self_attn.v_proj",
    "model.decoder.layers.3.self_attn.v_proj",
    "model.decoder.layers.2.self_attn.q_proj",
    "model.decoder.layers.0.encoder_attn.q_proj",
    "model.decoder.layers.8.self_attn.v_proj",
    "model.decoder.layers.10.encoder_attn.v_proj",
    "model.decoder.layers.13.self_attn.q_proj",
    "model.decoder.layers.17.self_attn.v_proj",
    "model.decoder.layers.16.self_attn.q_proj",
    "model.decoder.layers.18.encoder_attn.q_proj",
    "model.decoder.layers.8.encoder_attn.v_proj",
    "model.decoder.layers.13.encoder_attn.v_proj",
    "model.decoder.layers.22.encoder_attn.q_proj",
    "model.decoder.layers.16.encoder_attn.v_proj",
    "model.decoder.layers.19.encoder_attn.v_proj",
    "model.decoder.layers.1.encoder_attn.v_proj",
    "model.decoder.layers.12.encoder_attn.q_proj",
    "model.decoder.layers.3.encoder_attn.v_proj",
    "model.decoder.layers.10.self_attn.v_proj",
    "model.decoder.layers.8.encoder_attn.q_proj",
    "model.decoder.layers.5.encoder_attn.v_proj",
    "model.decoder.layers.7.self_attn.q_proj",
    "model.decoder.layers.16.self_attn.v_proj",
    "model.decoder.layers.22.self_attn.q_proj",
    "model.decoder.layers.21.self_attn.v_proj",
    "model.decoder.layers.23.encoder_attn.v_proj",
    "model.decoder.layers.12.encoder_attn.v_proj",
    "model.decoder.layers.2.encoder_attn.v_proj",
    "model.decoder.layers.21.self_attn.q_proj",
    "model.decoder.layers.6.self_attn.v_proj",
    "model.decoder.layers.14.self_attn.q_proj",
    "model.decoder.layers.23.self_attn.q_proj",
    "model.decoder.layers.15.encoder_attn.q_proj",
    "model.decoder.layers.5.encoder_attn.q_proj",
    "model.decoder.layers.4.encoder_attn.v_proj",
    "model.decoder.layers.5.self_attn.v_proj",
    "model.decoder.layers.6.self_attn.q_proj",
    "model.decoder.layers.19.self_attn.q_proj",
    "model.decoder.layers.1.encoder_attn.q_proj",
    "model.decoder.layers.4.self_attn.v_proj",
    "model.decoder.layers.8.self_attn.q_proj",
    "model.decoder.layers.11.encoder_attn.v_proj",
    "model.decoder.layers.15.self_attn.v_proj",
    "model.decoder.layers.2.encoder_attn.q_proj",
    "model.decoder.layers.13.encoder_attn.q_proj",
    "model.decoder.layers.2.self_attn.v_proj",
    "model.decoder.layers.14.encoder_attn.v_proj",
    "model.decoder.layers.0.self_attn.v_proj",
    "model.decoder.layers.19.self_attn.v_proj",
    "model.decoder.layers.14.encoder_attn.q_proj",
    "model.decoder.layers.11.self_attn.v_proj",
    "model.decoder.layers.17.encoder_attn.v_proj",
    "model.decoder.layers.22.self_attn.v_proj",
    "model.decoder.layers.12.self_attn.v_proj",
    "model.decoder.layers.19.encoder_attn.q_proj",
    "model.decoder.layers.20.encoder_attn.v_proj",
    "model.decoder.layers.7.self_attn.v_proj",
    "model.decoder.layers.12.self_attn.q_proj",
    "model.decoder.layers.23.encoder_attn.q_proj",
    "model.decoder.layers.17.encoder_attn.q_proj",
    "model.decoder.layers.15.encoder_attn.v_proj",
    "model.decoder.layers.16.encoder_attn.q_proj",
    "model.decoder.layers.11.self_attn.q_proj",
    "model.decoder.layers.0.self_attn.q_proj",
    "model.decoder.layers.18.self_attn.v_proj",
    "model.decoder.layers.1.self_attn.q_proj",
    "model.decoder.layers.10.self_attn.q_proj",
    "model.decoder.layers.3.self_attn.q_proj",
    "model.decoder.layers.1.self_attn.v_proj",
    "model.decoder.layers.7.encoder_attn.q_proj",
    "model.decoder.layers.17.self_attn.q_proj",
    "model.decoder.layers.15.self_attn.q_proj",
    "model.decoder.layers.20.self_attn.q_proj",
    "model.decoder.layers.23.self_attn.v_proj",
    "model.decoder.layers.20.self_attn.v_proj",
    "model.decoder.layers.4.encoder_attn.q_proj"
  ],
  "task_type": "CAUSAL_LM"
}